.github/actions/performance-test/test-plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.4" jmeter="5.4.3">
    <hashTree>
        <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
            <stringProp name="TestPlan.comments">Simple JMeter Test Plan for Flask App</stringProp>
            <elementProp name="TestPlan.user_defined_variables" elementType="Arguments">
                <collectionProp name="Arguments.args"/>
            </elementProp>
            <boolProp name="TestPlan.serialize_thread_groups">false</boolProp>
            <stringProp name="TestPlan.name">Flask App Performance Test</stringProp>
            <boolProp name="TestPlan.tearDownOnShutdown">true</boolProp>
            <hashTree/>
        </TestPlan>
        <hashTree>
            <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
                <stringProp name="ThreadGroup.num_threads">10</stringProp>
                <stringProp name="ThreadGroup.ramp_time">5</stringProp>
                <longProp name="ThreadGroup.duration"/>
                <longProp name="ThreadGroup.delay"/>
                <hashTree>
                    <httpSampler guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
                        <stringProp name="HTTPSampler.domain">localhost</stringProp>
                        <stringProp name="HTTPSampler.port">8080</stringProp>
                        <stringProp name="HTTPSampler.protocol">http</stringProp>
                        <stringProp name="HTTPSampler.path">/</stringProp>
                        <stringProp name="HTTPSampler.method">GET</stringProp>
                    </httpSampler>
                    <hashTree/>
                </hashTree>
            </ThreadGroup>
            <hashTree/>
        </hashTree>
    </hashTree>
</jmeterTestPlan>